Tekla Open API Reference for Tekla Structures 2025
AnalysisNodeLink.StartNode Property
 The start node.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisNode StartNode { get; set; }
Public Property StartNode As AnalysisNode
	Get
	Set
Property Value
Type: AnalysisNode
See Also
Reference
AnalysisNodeLink Class
Tekla.Structures.Analysis Namespace